app/controllers/blog_entries_controller.rb

  def index
    @blog_entries = BlogEntry.all
---
SELECT "blog_entries".* FROM "blog_entries"

  def create
    @blog_entry = BlogEntry.new(blog_entry_params)

    respond_to do |format|
      if @blog_entry.save
---
INSERT INTO "blog_entries" ("blog_id", "category", "created_at", "entry", "subject", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_blog_entry
      @blog_entry = BlogEntry.find(params[:id])
---
SELECT "blog_entries".* FROM "blog_entries" WHERE "blog_entries"."id" = ? LIMIT 1  [["id", "1"]]